[
  {
    "name": "Gereja Cor Jesu",
    "lat": -7.967191053999954,
    "long": 112.63192867900011,
    "image": "./corjesu.png",
    "iconKey": "Church",
    "address": "Samaan, Klojen",
    "fullAddress": "Jl. Jaksa Agung Suprapto No.55, Samaan, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Gratis Biaya Masuk",
    "workingOperational": "Sen - Sab: 05.30 - 06.30 WIB, \nMin : 6.00 - 7.30 WIB, 8.00 - 9.30 WIB, dan 17.30 - 19.00 WIB",
    "description": "Cor Jesu berasal dari bahasa latin yang memiliki arti Hati Kudus Yesus. Gereja ini didirikan oleh komunitas biarawati Ursulin pada awal abad ke-20 sebagai bagian dari kompleks pendidikan dan biara di Malang. Bangunan gereja ini dirancang oleh biro arsitek Belanda Cuypers-Hulswit-Fermont dan selesai dibangun pada tahun 1952 dengan gaya arsitektur neo-gotik.",
    "timeline": "Gereja Cor Jesu merupakan bagian penting dari sejarah perkembangan pendidikan dan spiritualitas di Kota Malang. Nama “Cor Jesu” berasal dari bahasa Latin yang berarti “Hati Kudus Yesus”, merepresentasikan semangat pelayanan dan kasih yang menjadi dasar pendiriannya. Gereja ini dibangun oleh komunitas biarawati Ursulin pada awal abad ke-20 sebagai bagian dari kompleks pendidikan dan biara yang mereka dirikan di kawasan Celaket, Malang. Pada masa awal kedatangan mereka, para suster Ursulin tidak hanya membangun fasilitas pendidikan seperti TK dan SD, tetapi juga sebuah tempat ibadah yang menjadi pusat kegiatan rohani. Rancangan bangunan gereja dipercayakan kepada biro arsitek ternama Belanda, Cuypers-Hulswit-Fermont, yang dikenal dengan gaya arsitektur bergaya Neo-Gotik. Proyek pembangunan gereja ini akhirnya selesai pada tahun 1952, menampilkan ciri khas langgam kolonial Eropa yang kuat, mulai dari struktur atap, jendela lengkung, hingga ornamen detail pada pintu dan interiornya. Sejak awal berdirinya, Gereja Cor Jesu tidak hanya berfungsi sebagai tempat ibadah komunitas Katolik, tetapi juga menjadi bagian dari pusat pendidikan dan pelayanan sosial yang dikelola oleh Yayasan Pendidikan Dhira Bhakti. Keunikan arsitektur dan nilai sejarahnya menjadikan kompleks Cor Jesu ditetapkan sebagai Bangunan Cagar Budaya Kota Malang sejak 2018."
  },
  {
    "name": "Balai Kota Malang",
    "lat": -7.978011068999933,
    "long": 112.63389592300007,
    "image": "./balai.png",
    "iconKey": "Gover",
    "address": "Kiduldalem, Klojen",
    "fullAddress": "Jl. Tugu No. 1, Kiduldalem, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Gratis Biaya Masuk",
    "workingOperational": "Sen - Kam: 08.00 - 16.00 WIB\nJum: 08.00 - 15.00 WIB\nSab - Min: Tutup",
    "description": "Balai Kota adalah gedung resmi tempat administrasi pemerintahan kota berlangsung. Balai Kota Malang dibangun pada tahun 1927 dan selesai pada 1929. Awalnya dikenal sebagai Gemeentehuis, yaitu pusat pemerintahan kolonial Belanda setelah Malang menjadi kotapraja (Gemeente) pada 1 April 1914. Arsitek H.F. Horn dari Semarang mendesain gedung ini dengan gaya arsitektur kolonial tropis, dilengkapi taman dan kolam bundar di depannya yang kini menjadi Tugu Merdeka. Setelah kemerdekaan Indonesia, bangunan ini diambil alih oleh pemerintah RI dan berfungsi hingga sekarang sebagai pusat administrasi Kota Malang.",
    "timeline": "Balai Kota Malang, dahulu dikenal sebagai Gemeentehuis, dibangun pada 1927 - 1929 sebagai pusat administrasi kolonial setelah Malang resmi menjadi kotapraja pada 1 April 1914. Proyek ini dirancang oleh arsitek asal Semarang, H.F. Horn, pemenang sayembara desain dengan motto “Voor de burgers van Malang” yang berarti “untuk warga Malang”. Gedung ini mengusung gaya arsitektur kolonial tropis Indische Empire yang simetris dan monumental, lengkap dengan taman serta kolam bundar di depannya, yang kini menjadi Tugu Merdeka. Balai Kota sempat mengalami kerusakan akibat agresi militer Belanda pada 29 Juli 1947, namun berhasil dipulihkan dan tetap difungsikan sebagai pusat pemerintahan pasca-kemerdekaan. Renovasi dilakukan secara berkala pada tahun 1950-an, 1986, 2002, dan 2016 untuk menjaga kelestarian dan fungsionalitas bangunan. Pada tahun 2018, gedung ini ditetapkan sebagai Bangunan Cagar Budaya Kota Malang karena nilai historis dan arsitekturnya yang khas. Hingga kini, Balai Kota Malang tetap menjadi simbol identitas kota dan saksi bisu perjalanan sejarahnya."
  },
  {
    "name": "Tugu Merdeka",
    "lat": -7.977131826999937,
    "long": 112.63418492300002,
    "image": "./tugu.png",
    "iconKey": "Monuments",
    "address": "Kiduldalem, Klojen",
    "fullAddress": "Jl. Tugu, Kiduldalem, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Gratis Biaya Masuk",
    "workingOperational": "Buka 24 Jam",
    "description": "Merdeka berati bebas atau lepas dari penjajahan. Secara keseluruhan Tugu Merdeka berarti monumen yang didirikan untuk memperingati kemerdekaan. Tugu Merdeka dibangun sebagai simbol peringatan kemerdekaan Republik Indonesia. Peletakan batu pertama dilakukan pada 17 Agustus 1946 oleh Wakil Gubernur Jawa Timur, Doel Arnowo. Namun, pada 23 Desember 1948, tugu ini dihancurkan oleh tentara Belanda selama Agresi Militer Belanda II. Setelah pengakuan kedaulatan, tugu dibangun kembali dan diresmikan oleh Presiden Soekarno pada 20 Mei 1953 dengan nama Tugu Nasional.",
    "timeline": "Tugu Merdeka, yang juga dikenal sebagai Monumen Tugu Kemerdekaan Malang, dibangun sebagai simbol peringatan hari kemerdekaan Republik Indonesia. Peletakan batu pertamanya dilakukan pada 17 Agustus 1946 oleh Wakil Gubernur Jawa Timur Doel Arnowo, menandai harapan baru pasca Proklamasi Kemerdekaan. Sayangnya, pada tanggal 23 Desember 1948, tugu ini dihancurkan oleh tentara Belanda selama Agresi Militer II, karena dianggap sebagai simbol perlawanan rakyat Malang. Setelah pengakuan kedaulatan, warga Malang membentuk panitia pembangunan kembali tugu ini pada 9 Juni 1950, dan selanjutnya proses rekonstruksi berlangsung hingga tugu baru berdiri megah. Tugu kembali diresmikan oleh Presiden Soekarno pada 20 Mei 1953, bertepatan dengan Hari Kebangkitan Nasional. Tugu ini menampilkan filosofi simbolisme kuat : bambu runcing di puncak, rantai, bintang delapan tingkatan, serta tangga bermakna tanggal 17 Agustus 1945. Hingga kini, Tugu Merdeka tetap menjadi landmark dan pusat kegiatan publik di Alun-Alun Tugu, serta menjadi saksi bisu perjalanan sejarah dan semangat kemerdekaan Kota Malang."  
  },
  {
    "name": "Kayutangan Heritage",
    "lat": -7.97641030799997,
    "long": 112.62936035000007,
    "image": "./kayu.PNG",
    "iconKey": "Gover",
    "address": "Kaman, Klojen",
    "fullAddress": "Jl. Jenderal Basuki Rahmat, Kauman, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Rp 5.000/orang",
    "workingOperational": "Sen - Min: 07.00 - 18.30 WIB",
    "description": "Kayutangan berasal dari tanaman menjalar yang bernama patangtangan, yang daunya menyerupai bentuk tangan manusia. Ada beberapa versi terkait sejarah wilayah ini. Versi Pertama menjelaskan bahwa pada masa kolonial, daerah ini terdapat papan penunjuk arah dari kayu berbentuk tangan di kawasan ini yang digunakan sebagai penanda arah bagi para pelancong. Versi lainnya, terkait dengan banyaknya pohon dengan daun yang menyerupai telapak tangan di sepanjang jalan, yang memberikan kesan visual seperti tangan - tangan yang menjulur, sehingga kawasan ini dinamakan kayutangan.",
    "timeline": "Kayutangan, dulunya dikenal sebagai Patangtangan, berasal dari bahasa Jawa Kawi yang merujuk pada tanaman menjalar dengan daun berbentuk seperti tangan manusia yang telah ada sejak abad ke‑12, tertuang dalam Prasasti Pamotoh dari Kerajaan Kadiri. Kota Malang mengenal era kolonial melalui nama Kajoetanganstraat. Ada berbagai versi sejarah terkait penamaan tersebut: pertama, adanya tanda penunjuk arah dari kayu berbentuk tangan di persimpangan Kayutangan yang digunakan Belanda; kedua, deretan pohon dengan daun mirip telapak tangan sepanjang jalan memberikan kesan visual seperti “tangan menjulur”. Seiring perkembangan, kawasan ini dipadati bangunan bergaya Eropa sejak 1914–1939 dan menjadi koridor bisnis utama, dengan jalur trem, pertokoan, dan jembatan pejalan kaki landmark Kota Malang. Kini, Kayutangan dihidupkan kembali sebagai Kampoeng Heritage, resmi sejak 22 April 2018, menampilkan keaslian arsitektur, souvenir, kuliner, serta kampung bersejarah yang menjadi daya tarik wisata budaya Kota Malang."
  },
  {
    "name": "Klenteng Eng An Kiong",
    "lat": -7.987421,
    "long": 112.635857,
    "image": "./klenteng.png",
    "iconKey": "Temple",
    "address": "Kotalama, Kedungkandang",
    "fullAddress": "Jl. R.E. Martadinata No.1, Kotalama, Kec. Kedungkandang, Kota Malang, Jawa Timur",
    "fee": "Rp 5.000/orang",
    "workingOperational": "Sab - Min: 08.00-21.00 WIB",
    "description": "Eng memiliki arti selamanya, sementara An berarti damai atau aman dan Kiong berarti istana atau candi. Sehingga secara keseluruhan Eng An Kiong berarti Istana keselamatan dalam keabadian Tuhan. Klenteng ini didirikan pada tahun 1825 oleh  Letnan Kwee Sam Hway, seorang perwira militer keturunan Tionghoa. Pembangunan klenteng ini dilakukan dalam dua tahap: tahap pertama pada tahun 1825 untuk ruang utama, dan tahap kedua antara tahun 1895 hingga 1934 untuk bangunan tambahan.",
    "timeline": "Klenteng Eng An Kiong didirikan pada tahun 1825 oleh Letnan Kwee Sam Hway, seorang perwira militer keturunan Tionghoa, sebagai tempat ibadah utama para penganut Tridharma di Malang. Nama “Eng An Kiong” secara harfiah berarti Istana Keselamatan dalam Keabadian Tuhan, merujuk pada persembahan kepada Dewa Bumi serta nilai spiritual yang diusungnya. Pembangunan klenteng dilakukan dalam dua tahap: tahap pertama pada 1825, berupa ruang utama; tahap kedua berlangsung dari 1895 hingga 1934, menambah ruang altar dan sayap bangunan. Di dalamnya terdapat altar bagi Konghucu, Tao, dan Buddha, lengkap dengan patung Dewa Bumi yang dibawa dari Tiongkok menggunakan tandu kayu jati berlapis emas. Sebagai salah satu bangunan cagar budaya tertua di Malang, hampir 90% struktur asli klenteng ini masih terjaga, mencerminkan keaslian arsitektur tradisional Tiongkok dengan ornamen naga dan cat merah-kuning khas. Hingga kini, Eng An Kiong tidak hanya sebagai tempat ibadah tetapi juga menjadi pusat kegiatan budaya dan simbol toleransi antarumat beragama."
  },
  {
    "name": "Gereja Immanuel Malang",
    "lat": -7.981724174999954,
    "long": 112.63014554300003,
    "image": "./imanuel.png",
    "iconKey": "Church",
    "address": "Kiduldalem, Klojen",
    "fullAddress": "Jl. Merdeka Barat No.9, Kiduldalem, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Gratis Biaya Masuk",
    "workingOperational": "Sen: Tutup \nSel - Sab: 09.00 - 17.00 WIB \nMin: 8.00-10.00 WIB dan 17.00-19.00 WIB",
    "description": "Immanuel berasal dari bahasa Ibrani yang berart Allah beserta kita. Gereja ini didirikan pada tahun 1861 dengan nama Protestantse Gemeente te Malang. Gereja ini awalnya digunakan sebagai tempat ibadah bagi orang-orang Belanda dan Eropa lainnya yang beragama Kristen Protestan.  Arsitektur gereja ini bergaya Gotik, mencerminkan ciri khas gereja pada pertengahan abad ke-19. Pada tahun 1912, gereja ini pernah dibongkar dan dibangun kembali dengan bentuk yang sama seperti yang tampak sekarang. Gereja ini juga menyimpan dua Alkitab kuno yang dicetak pada tahun 1618 dan 1715 Masehi, yang merupakan peninggalan dari zaman penjajahan Belanda.",
    "timeline": "Gereja Immanuel bermakna “Allah beserta kita”, didirikan pada 1861 dengan nama awal Protestantse Gemeente te Malang, sebagai tempat ibadah bagi warga Belanda dan Eropa beragama Kristen Protestan. Bangunan ini mengusung gaya arsitektur Gothik klasik, mewakili karakter gereja abad ke-19. Pada tahun 1912, gereja ini sempat dibongkar dan dibangun kembali dengan desain yang sama, mempertahankan struktur dua lantai dan interior ala kolonial Belanda seperti mimbar, ruang peribadatan, serta menara dengan jam dan lonceng asli. Seiring perkembangan kota, struktur gereja tetap kokoh meski halaman sempat menyusut akibat ekspansi jalan utama. Salah satu ciri unik gereja ini adalah dua Alkitab kuno berbahasa Belanda yang dicetak pada tahun 1618 dan 1715, disimpan rapi dalam lemari kaca dari kayu jati, bersampul kulit domba dan pengait logam—beratnya mencapai hampir 5 kg serta tebal 10–12 cm. Alkitab ini menjadi saksi sejarah gereja dan pernah diminta untuk diambil oleh pemerintah, tetapi ditolak demi menjaga nilainya. Bangunan ini juga ditetapkan sebagai cagar budaya Kota Malang sejak 2018, dengan renovasi ringan pada 1998 dan 2015, termasuk penggantian rangka atap agar keasliannya tetap terjaga. Saat ini, Gereja Immanuel tidak hanya menjadi tempat ibadah bagi lebih dari 1.200 jemaat setiap minggu, tetapi juga simbol toleransi beragama—berjarak hanya beberapa meter dari Masjid Agung Jami’ Malang."
  },
  {
    "name": "Masjid Agung Jami'",
    "lat": -7.982436675999963,
    "long": 112.62985126000001,
    "image": "./masjid.png",
    "iconKey": "Mosque",
    "address": "Kauman, Klojen",
    "fullAddress": "Jl. Merdeka Barat No.3, Kauman, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Gratis Biaya Masuk",
    "workingOperational": "Sen - Min: 04.00 - 20.00 WIB",
    "description": "Agung dalam Bahasa Indonesia berarti besar atau megah. Jami' berasal dari Bahasa Arab yang berarti tempat berkumpul. Secara keseluruhan, Masjid Agung Jami' berarti masjid besar tempat berkumpulnya umat Islam.  Masjid ini dibangun dalam dua tahap. Tahap pertama dimulai pada tahun 1890 M, dan tahap kedua dimulai pada 15 Maret 1903 serta selesai pada 13 September 1903. Masjid ini didirikan di atas tanah Goepernemen (tanah negara) seluas sekitar 3.000 m². Bangunan masjid berbentuk bujur sangkar dengan struktur baja dan atap tajug tumpang dua, menggabungkan gaya arsitektur Jawa dan Arab.",
    "timeline": "Nama Jami’ berasal dari bahasa Arab yang berarti tempat berkumpul, dan Agung menunjukkan ukuran dan keagungan masjid ini “Masjid Besar Tempat Berkumpulnya Umat Islam”. Masjid ini dibangun di atas tanah negara seluas sekitar 3.000 m², melalui dua tahap konstruksi: tahap pertama dimulai pada 1890 M, dan tahap kedua berlangsung dari 15 Maret hingga 13 September 1903.Bangunannya berbentuk bujur sangkar dengan struktur baja dan atap tajug tumpang dua, yang menunjukkan kombinasi gaya arsitektur Jawa terlihat pada bentuk atap tradisional dan struktur soko guru dan Arab, nampak dari kubah menara serta konstruksi lengkung pada pintu dan jendela. Sejak awal berdirinya, bangunan utama masjid tetap dipertahankan, meskipun beberapa bagian seperti serambi dimodifikasi pada tahun 2000 untuk menambah menara depan serta kubah tambahan. Struktur lantai menunjukkan perbedaan level antara area suci dan halaman, mencerminkan hierarki kesucian ruang ibadah. Kini, Masjid Agung Jami’ Malang tidak hanya sebagai tempat ibadah, tetapi juga menjadi landmark religi dan simbol toleransi, berdampingan dengan Gereja Immanuel—mewakili kerukunan antar umat beragama di pusat kota Malang."
  },
  {
    "name": "Gereja Katolik Paroki Hati Kudus Yesus",
    "lat": -7.980694382999957,
    "long": 112.63077145600005,
    "image": "./hatikudus.PNG",
    "iconKey": "Church",
    "address": "Kiduldalem, Klojen",
    "fullAddress": "Jl. MGR Sugiyopranoto No.2, Kiduldalem, Kec. Klojen, Kota Malang, Jawa Timur",
    "fee": "Gratis Biaya Masuk",
    "workingOperational": "Sen - Min: 08.00 - 18.00 WIB",
    "description": "Paroki Hati Kudus Yesus memiliki arti wilayah pelayanan gereja Katolik yang menekankan kasih dan belas kasih Yesus Kristus.  Gereja ini awalnya merupakan bagian dari Paroki Kepanjen Surabaya dan mulai berdiri sendiri pada 4 Juni 1897. Pembangunan gereja dimulai dengan peletakan batu pertama oleh Pater G.D.A. Jonckbloet, S.J. pada 11 Mei 1905 dan selesai dalam waktu tujuh bulan. Gereja ini dirancang oleh arsitek Belanda, Ir. Marius J. Hulswit, dengan gaya arsitektur Neo-Gotik. Nama Hati Kudus Yesus dipilih untuk mengungkapkan dedikasi umat Katolik terhadap devosi yang sangat populer pada masa itu.",
    "timeline": "Paroki Hati Kudus Yesus bermakna wilayah pelayanan gereja Katolik yang menempatkan kasih dan belas kasih Yesus Kristus sebagai fondasinya. Awalnya, paroki ini adalah bagian dari Paroki Kepanjen Surabaya, sebelum secara resmi berdiri sendiri pada 4 Juni 1897. Pembangunan gereja dimulai dengan peletakan batu pertama oleh Pater G.D.A. Jonckbloet, S.J. pada 11 Mei 1905, dan selesai dalam waktu tujuh bulan, diresmikan pada 7 Januari 1906. Bangunan ini dirancang oleh arsitek Belanda, Ir. Marius J. Hulswit, dengan gaya arsitektur Neo‑Gotik, dilengkapi dua menara setinggi 33 m yang ditambahkan pada tahun 1930 oleh Ir. Albert Grunberg. Nama “Hati Kudus Yesus” diambil dari devosi Katolik yang populer saat itu, menandai komitmen rakyat akan kasih Ilahi. Gereja ini juga menyimpan berbagai artefak bersejarah seperti Alkitab kuno, lonceng dari Belanda, dan prasasti marmer yang dipasang pada 16 Maret 1907. Saat ini, bangunan ini tidak hanya menjadi tempat ibadah umat Katolik, tetapi juga menjadi warisan budaya dan simbol toleransi yang kuat di pusat Kota Malang."
  },
  {
    "name": "Idjen Boulevard",
    "lat": -7.972359138999934,
    "long": 112.62179437300006,
    "image": "./idjen.png",
    "iconKey": "Gover",
    "address": "Oro-oro Dowo, Klojen",
    "fee": "Gratis Biaya Masuk",
    "fullAddress": "Jl. Ijen, Oro - oro Dowo, Kec. Klojen, Kota Malang, Jawa Timur",
    "workingOperational": "Buka 24 Jam",
    "description": "Idjen merujuk pada nama Gunung Ijen, mengikuti pola penamaan kawasan dengan nama-nama gunung di Jawa. Boulevard berasal dari Bahasa Belanda, berarti jalan lebar yang biasanya memiliki taman di tengahnya.  Idjen Boulevard dibangun pada masa Hindia Belanda sebagai bagian dari rencana pengembangan kota yang dikenal dengan nama Bouwplan. Pembangunan kawasan ini dimulai pada tahun 1935 dan berlangsung hingga 1960, dirancang oleh arsitek Belanda terkenal, Ir. Herman Thomas Karsten. Kawasan ini dirancang sebagai pemukiman elit bagi pejabat dan pengusaha Belanda, dengan konsep boulevard yang memiliki taman di tengah jalan dan pohon palem di sepanjang sisi jalan.",
    "timeline": "Idjen Boulevard, yang diberi nama mengikuti tradisi penamaan kawasan dengan nama gunung di Jawa, dibangun pada era Hindia Belanda sebagai bagian dari strategi perluasan kota dalam Bouwplan, dimulai pada tahun 1935 dan berlangsung hingga 1960. Desain jalan kembar ini dilaksanakan oleh arsitek Belanda ternama, Ir. Herman Thomas Karsten, dengan konsep boulevard—jalan dipisahkan taman median dan dihiasi deretan pohon palem—menunjukkan estetika romantis sekaligus fungsionalitas ruang perkotaan elit. Kawasan ini awalnya difungsikan sebagai pemukiman elit bagi pejabat dan pengusaha Belanda, dilengkapi vila-vila megah, taman kota, dan trotoar pejalan kaki yang teduh. Karsten juga mengintegrasikan jalur silang ke jalan-jalan bernama gunung lain seperti Kawi, Semeru, dan Salak, menjadikannya bagian dari perencanaan soma bergenbuurt atau kawasan “gunung-gunung”. Setelah kemerdekaan, Idjen Boulevard tetap menjadi kawasan bernilai tinggi dan mendapat status Cagar Budaya Kota Malang sejak 2015, dengan berbagai pengembangan yang menjaga keindahan pedestrian hingga area publik sekitarnya seperti taman, trotoar, dan fasilitas acara seperti Car Free Day."
  },
  {
    "name": "Kuburan Londo",
    "lat": -7.9953775669999345,
    "long": 112.61971584500009,
    "image": "./kuburan.png",
    "iconKey": "Stone",
    "address": "Oro-oro owo, Klojen",
    "fee": "Gratis Biaya Masuk",
    "fullAddress": "Jl. S. Supriadi No.36, Sukun, Kec. Sukun, Kota Malang, Jawa Timur",
    "workingOperational": "Buka 24 Jam",
    "description": "Londo adalah istilah lokal untuk Belanda. Tempat ini adalah pemakaman kolonial peninggalan Belanda yang sudah ada sejak masa penjajahan. Banyak tokoh Belanda yang dimakamkan di lokasi ini, menjadikannya simbol sejarah kolonial di Kota Malang. Istilah Kuburan Londo muncul karena dulunya hanya orang-orang Belanda yang dimakamkan disini. Kini, kawasan ini menjadi obyek wisata sejarah dengan nuansa arsitektur Eropa yang masih terawat.",
    "timeline": "Kuburan Londo, atau TPU Nasrani Sukun, merupakan pemakaman kolonial Eropa yang dibangun pada masa Bouwplan III antara 1919–1920 sebagai tempat peristirahatan terakhir bagi warga Belanda dan Eropa di Malang. Luasnya mencapai sekitar 12.000 m², dengan lebih dari 200 makam, meski hanya sekitar 20 makam yang profilnya teridentifikasi. Gerbang utama kawasan ini dirancang oleh arsitek Thomas Herman Karsten, tampil dengan gaya arsitektur Eropa yang kokoh, dan kini bangunannya masih berdiri kokoh sebagai gerbang masuk ke kompleks makam . Sejumlah tokoh penting seperti pendiri RS Lavalette, perwira KNIL, dan tokoh Gereja Kristen Jawi Wetan juga dimakamkan di sini. Sejak 2019, kawasan ini ditetapkan sebagai Cagar Budaya Kota Malang, dan pengelolaannya kini melibatkan forum lokal guna menjaga warisan sejarah dan mengembangkannya menjadi destinasi wisata heritage—termasuk introduksi wisata malam dan even panen kopi di area pekuburan. Kuburan Londo kini menjadi simbol historiografi perkotaan Malang, membawa pengunjung menelusuri kisah kolonial yang masih bergaung hingga kini."
  }
] 